#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=155959da-6fbe-47cf-87bb-4e3dda3c5f5b]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=625a2b5c-ec5b-4f25-ac04-c423053083bf]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=606e17b3-be4f-4cab-8a4d-b70d1a60d0b9]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=5a9e7c64-9520-4a38-9000-c978bfae235f]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d82ffd30-d281-4077-8bca-cb05d8dc37a7]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d1ecd95e-f8f4-44b7-8188-dfce9342285b]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dfe3d10d-5cab-4b23-8970-8fa455b5a231]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8bb345e7-6e26-4ebd-89c4-094fcaa2c684]
module.keycloak_prod.module.onestopauth_basic.module.client_jon-mar-3-b-ce-id-basic-non-prod-to-prod-6075.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0d8edbff-be35-45cc-a6b4-3c715bab05ca]
module.keycloak_prod.module.onestopauth_basic.module.client_jon-mar-3-b-ce-id-basic-non-prod-to-prod-6075.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d9c2fbb3-7c9d-4deb-b2d4-71321d823919]
module.keycloak_prod.module.onestopauth_basic.module.client_jon-mar-3-b-ce-id-basic-non-prod-to-prod-6075.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e41fdd96-1a80-4125-a82f-a7828616078c]
module.keycloak_prod.module.onestopauth_basic.module.client_jon-mar-3-b-ce-id-basic-non-prod-to-prod-6075.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=918b09cc-c520-419a-9282-75ec02e4f7d8]
module.keycloak_prod.module.onestopauth_basic.module.client_jon-mar-3-b-ce-id-basic-non-prod-to-prod-6075.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=995406b2-870d-485b-85bb-294f3221d888]
module.keycloak_prod.module.onestopauth_basic.module.client_jon-mar-3-b-ce-id-basic-non-prod-to-prod-6075.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a8429de8-03ae-4481-9b19-e1442089fe99]
module.keycloak_prod.module.onestopauth_basic.module.client_jon-mar-3-b-ce-id-basic-non-prod-to-prod-6075.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8407c4a6-7695-4fed-9f8f-75a2e9a14982]
module.keycloak_prod.module.onestopauth_basic.module.client_jon-mar-3-b-ce-id-basic-non-prod-to-prod-6075.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6c9f1c66-df2a-4110-b020-01fe1fe74eec]
module.keycloak_prod.module.onestopauth_basic.module.client_jon-mar-3-b-ce-id-basic-non-prod-to-prod-6075.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=fecdfd44-cd43-4dea-9f8a-d7fb9c530303]
module.keycloak_prod.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=66bc5673-cd88-4daf-8d38-25db14361338]
module.keycloak_prod.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b3bd0845-a8ce-47a6-a9b1-e7e78150cd22]
module.keycloak_prod.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=69614bd8-0d49-43ca-b016-9f87ec7480fc]
module.keycloak_prod.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c1cb12c2-cd6d-4b65-b3ff-e286591cd8f4]
module.keycloak_prod.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a6d8da00-00ea-4fe2-bd9c-37b2a3f71182]
module.keycloak_prod.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=75e80377-a000-468d-b8b0-ecd0275d23c6]
module.keycloak_prod.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9d477eb1-bb55-46a1-b376-af26343f013c]
module.keycloak_prod.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5acca585-c82b-4301-b14f-1e4c23d949d2]
module.keycloak_prod.module.onestopauth_basic.module.client_march-3-test-b-ce-id-non-p-rod-6139.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=48c27776-3b6e-4b8d-b561-f67b22e8008a]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=091da1a6-6014-41b4-98ee-c53dfdd246f7]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=42ed7ce9-97fd-41f5-b1a5-396aaa536b54]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a1962625-0440-4341-a62a-5e9c2e6ad824]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d24fdc7b-8eac-4609-a1fc-268ad591bd3f]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f3734d10-a3df-44b1-9d0e-621b4330c19d]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1aa1cd7a-0f72-42f8-8b5c-3c83c0291c19]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=dd77bdc3-d27c-4960-a483-a150e3e98b6a]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=436f35e7-7a2a-46c6-871c-bbece3c0dc75]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=aaf37759-2442-42dd-ab01-db572d096946]
module.keycloak_prod.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=283bd97b-6bad-40ba-b5e7-cf9adfe63776]
module.keycloak_prod.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0d74bcb1-db11-4683-94da-4db5c259ea89]
module.keycloak_prod.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=537e2621-9aac-4c07-8d63-0ea64037752e]
module.keycloak_prod.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=323d3d4e-992e-4d9c-9ffd-4f838678f6b4]
module.keycloak_prod.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6bd849ca-0bfc-4608-ba61-0d5da3821d47]
module.keycloak_prod.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e0b8121b-7463-4ce7-9376-e866d3b4788e]
module.keycloak_prod.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=12e00faf-bd0a-4f93-8ab6-2a32b275b5ad]
module.keycloak_prod.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=6f2b6fc6-5f84-4fbf-ad74-e8bb1bb9555a]
module.keycloak_prod.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a736f4bf-c9ec-4fa2-b0ce-220fff43a5ac]
module.keycloak_prod.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=1b05ecb5-0063-4884-81f4-4a10d820ba36]
module.keycloak_prod.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6d6060db-8180-4499-9d3e-dfee55b6742d]
module.keycloak_prod.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=2aedeabc-fd86-4b80-b22a-1b684370f778]
module.keycloak_prod.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=96b6cb26-9ec1-4a8d-8361-eb21168756ce]
module.keycloak_prod.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=46da2e78-f6d7-414e-9a5e-e21353807452]
module.keycloak_prod.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ac9f8594-a744-4ad6-97a5-0d5ed27eef5f]
module.keycloak_prod.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=57775bf3-a8a0-4fc8-a32d-c99ca1c2cfee]
module.keycloak_prod.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=56beaef5-2ded-4295-b2e7-20756dc204ac]
module.keycloak_prod.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=cae288e2-3ae8-4965-9782-895085da0ac3]
module.keycloak_prod.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8100b553-c9fa-45ca-bc0c-8c76f9aaf429]
module.keycloak_prod.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=53e679e8-17a6-48f0-8135-7dbaf98f226f]
module.keycloak_prod.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=9cc28c8c-a044-4da1-ae5a-953c623a383a]
module.keycloak_prod.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9d18bf2b-c312-493f-8217-073b0f04a613]
module.keycloak_prod.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=646a39fa-18ee-482f-a923-3c10a6382f6d]
module.keycloak_prod.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4d53613c-a560-4105-bf32-5753f733d68b]
module.keycloak_prod.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=7d4b6185-a613-4999-a848-30ed4a863636]
module.keycloak_prod.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=390c6c6b-bedd-456c-8a0d-08fcac1aefe6]
module.keycloak_prod.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1bbd75af-5bf8-4285-b088-4f08632a0574]
module.keycloak_prod.module.onestopauth_business.module.client_march-4-zorin-test-1-6337.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ef45b052-1009-4ec3-9392-dc0ca4c756a4]
module.keycloak_prod.module.onestopauth_business.module.client_march-4-zorin-test-1-6337.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c0336273-e791-40ec-9d73-480bc015c479]
module.keycloak_prod.module.onestopauth_business.module.client_march-4-zorin-test-1-6337.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4b31c431-76cc-464b-9e23-1a0a79f04def]
module.keycloak_prod.module.onestopauth_business.module.client_march-4-zorin-test-1-6337.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=20235f20-f637-4f0c-a142-5553a1b7b8d7]
module.keycloak_prod.module.onestopauth_business.module.client_march-4-zorin-test-1-6337.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4e287622-a50b-4519-86b2-2963eb357e39]
module.keycloak_prod.module.onestopauth_business.module.client_march-4-zorin-test-1-6337.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=073318d4-8e0e-48f6-a578-bb4357b33699]
module.keycloak_prod.module.onestopauth_business.module.client_march-4-zorin-test-1-6337.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=bee53658-2644-4daf-b40f-344c0562cb55]
module.keycloak_prod.module.onestopauth_business.module.client_march-4-zorin-test-1-6337.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=278c3ebf-f49f-4a11-8bed-5c6ddab0e92a]
module.keycloak_prod.module.onestopauth_business.module.client_march-4-zorin-test-1-6337.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=585f3a2d-b4e7-49d4-a149-bd48a86ea7fe]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.display_name_mapper: Refreshing state... [id=478093b5-1d85-44ee-9290-1dde831f4bb2]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "kuro-mar-07-b-ce-id-basic-test-6370"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "kuro-mar-07-b-ce-id-basic-test-6370"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.display_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "display_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "displayName"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "kuro-mar-07-b-ce-id-basic-test-6370"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "kuro-mar-07-b-ce-id-basic-test-6370"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://bceidDev.com",
        ]
      + web_origins                              = [
          + "+",
          + "http://bceidDev.com",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "kuro-mar-07-b-ce-id-basic-test-6370"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "kuro-mar-07-b-ce-id-basic-test-6370"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.display_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "display_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "display_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "displayName"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "display_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-07-b-ce-id-basic-test-6370.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "kuro-mar-07-b-ce-id-basic-test-6370"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "kuro-mar-07-b-ce-id-basic-test-6370"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://bceidTest.com",
        ]
      + web_origins                              = [
          + "+",
          + "http://bceidTest.com",
        ]
    }

Plan: 20 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 4230 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*